bookmark_api/app/controllers/bookmarks_controller.rb

  def create
    @bookmark = Bookmark.new(bookmark_params)

    if @bookmark.save
---
INSERT INTO "bookmarks" ("name", "logo", "description", "link", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "node.js"], ["logo", "n/a"], ["description", "ORM"], ["link", "N/A"], ["created_at", "2020-04-03 14:56:02.345917"], ["updated_at", "2020-04-03 14:56:02.345917"]]

  def update
    if @bookmark.update(bookmark_params)
---
UPDATE "bookmarks" SET "description" = $1, "updated_at" = $2 WHERE "bookmarks"."id" = $3  [["description", "Change"], ["updated_at", "2020-04-03 19:59:49.898051"], ["id", 1]]

  def destroy
    @bookmark.destroy
---
DELETE FROM "bookmarks" WHERE "bookmarks"."id" = $1  [["id", 2]]